{
  "Version": "1.3",
  "ID": "f1awaukjvlselaifiyklt3aad2kcl56z62vzbj2ia",
  "Issue Number": "8",
  "Client": {
    "Name": "Jingshengya",
    "Region": "China",
    "Industry": "Education & Training",
    "Website": "https://www.jingshengya.net/#/index",
    "Social Media": "https://www.jingshengya.net/#/index",
    "Social Media Type": "Other",
    "Role": "Data Preparer"
  },
  "Project": {
    "Brief history of your project and organization": "The Jing Shengya Education System, an autonomous brand under Sichuan Jiafa Jing Shengya Education Technology Co., Ltd., a subsidiary of Jiafa Education, focuses on the research and development of big data platforms for college preference selection following the College Entrance Examination (CEE), career planning platform development, consulting services for career planning and college preference selection, training for consultants specializing in career planning and college preference selection, as well as winter and summer camp training programs for career planning. It provides online services for CEE college preference selection, subject choice guidance for new CEE reforms, career planning, comprehensive quality evaluation, and admission planning services such as the Strong Foundation Plan to over 9 million college entrance examinees each year.\n\nSince 2016, Jing Shengya has cumulatively served more than 3 million examinees across the country, becoming an influential platform within the industry for career planning and college preference selection. After years of research and accumulation, Jing Shengya now covers 29 provinces and has nearly ten million registered users.",
    "Is this project associated with other projects/ecosystem stakeholders?": "No",
    "Describe the data being stored onto Filecoin": "Education and Training Related Videos",
    "Where was the data currently stored in this dataset sourced from": "My Own Storage Infra",
    "How do you plan to prepare the dataset": "I am a data preparer, primarily responsible for using Filecoin official tools such as Boost, Lotus, and Singularity to prepare and package data.At the beginning of the process, I receive raw data from clients or data providers, and then organize, verify, and deduplicate it to ensure its integrity and usability.Next, I use the Singularity tool to convert the raw data into a format suitable for storage on the Filecoin network, generating CAR (Content Addressable aRchive) files.CAR files serve as key carriers for on-chain data, containing not only the actual data but also the associated data fingerprint (Data CID), which facilitates verification and retrieval later on.After that, I perform further data sealing operations using Lotus, while leveraging Boost to improve data transfer efficiency, ensuring a smooth and stable process.Once the data is sealed, I compile all relevant information—including data size, CID, sector number, etc.—into a CSV form and submit it to the Storage Provider (SP).The SP can then import the CAR files via the CSV form and upload them to the Filecoin network for formal storage and proof submission.Throughout this process, I must also ensure that all data complies with Filecoin's technical specifications and storage standards to avoid upload failures caused by format issues.This series of steps makes up the core workflow of data preparation in the Filecoin network, forming a critical link between user data and decentralized storage infrastructure.",
    "Please share a sample of the data (a link to a file, an image, a table, etc., are good ways to do this.)": "http://wx.jingshengya.net/",
    "Confirm that this is a public dataset that can be retrieved by anyone on the network (i.e., no specific permissions or access rights are required to view the data)": "[X] I confirm",
    "What is the expected retrieval frequency for this data": "Sporadic",
    "For how long do you plan to keep this dataset stored on Filecoin": "2 to 3 years",
    "In which geographies do you plan on making storage deals": "Greater China, Asia other than Greater China, Africa, North America, South America, Europe, Australia (continent), Antarctica",
    "How will you be distributing your data to storage providers": "HTTP or FTP server, Shipping hard drives",
    "Please list the provider IDs and location of the storage providers you will be working with. Note that it is a requirement to list a minimum of 5 unique provider IDs, and that your client address will be verified against this list in the future": "f03298672  \nf03298673  \nf03308920  \nf03308922  \nf03308933  \nf03336022  \nf03336023 \nf03620434 \nf03340635  \nf03385456  \nf03385462  \nf03402285  \nf03620446\nf03402308  \nf03402347  \nf03402379  \nf03540144  \nf03540147  \nf03620441\nf03540153  \nf03601955  \nf03601967  \nf03601993\nf03620433\nf03620442\nf03620447 ",
    "Can you confirm that you will follow the Fil+ guideline (Data owner should engage at least 4 SPs and no single SP ID should receive >30% of a client's allocated DataCap)": "Yes"
  },
  "Datacap": {
    "Type": "ldn-v3",
    "Data Type": "Slingshot",
    "Total Requested Amount": "8PiB",
    "Single Size Dataset": "780TiB",
    "Replicas": 10,
    "Weekly Allocation": "1000TiB"
  },
  "Lifecycle": {
    "State": "Granted",
    "Validated At": "2025-07-16 13:58:12.608721522 UTC",
    "Validated By": "spaceT9",
    "Active": true,
    "Updated At": "2025-07-16 13:58:12.608717631 UTC",
    "Active Request ID": "3d97de53-7150-42ff-a437-17e54ceb4f5b",
    "On Chain Address": "f1awaukjvlselaifiyklt3aad2kcl56z62vzbj2ia",
    "Multisig Address": "false",
    "edited": false
  },
  "Allocation Requests": [
    {
      "ID": "dd1e1c5d-1c49-47e5-8557-2653dc314a7d",
      "Request Type": "First",
      "Created At": "2025-01-17 13:27:18.050511096 UTC",
      "Updated At": "2025-01-17 13:27:18.050512198 UTC",
      "Active": false,
      "Allocation Amount": "400TiB",
      "Signers": [
        {
          "Github Username": "spaceT9",
          "Signing Address": "f1id4vdnfmhic5lgf33jpwdugqphso7kmauc2w4va",
          "Created At": "2025-01-17 13:31:07.561000000 UTC",
          "Message CID": "bafy2bzacebujahcxrjoun36j5uzce3rdtochpbuo3qfms5vvpa7e42dkcngry"
        }
      ]
    },
    {
      "ID": "6eb88629-191b-4977-9806-39cfe1844ff5",
      "Request Type": "Refill",
      "Created At": "2025-02-10 11:43:54.844267071 UTC",
      "Updated At": "2025-02-10 11:43:54.844267755 UTC",
      "Active": false,
      "Allocation Amount": "800TiB",
      "Signers": [
        {
          "Github Username": "spaceT9",
          "Signing Address": "f1id4vdnfmhic5lgf33jpwdugqphso7kmauc2w4va",
          "Created At": "2025-02-10 11:46:01.256000000 UTC",
          "Message CID": "bafy2bzacebfrjmtbovjea45w7hyi7jb3bo7ynh7pdqo3hjb7djgmnnarwxzp2"
        }
      ]
    },
    {
      "ID": "d14480e0-8ba4-46de-a2b9-7cbe8e1ec2fa",
      "Request Type": "Refill",
      "Created At": "2025-04-26 00:56:19.716541184 UTC",
      "Updated At": "2025-04-26 00:56:19.716542184 UTC",
      "Active": false,
      "Allocation Amount": "879609302220800B",
      "Signers": [
        {
          "Github Username": "spaceT9",
          "Signing Address": "f1id4vdnfmhic5lgf33jpwdugqphso7kmauc2w4va",
          "Created At": "2025-04-26 01:00:07.966000000 UTC",
          "Message CID": "bafy2bzacecvppbedmovah33gjgwojlv5u3r2a5alrgkrnf7pjj3wrekr3ysda"
        }
      ]
    },
    {
      "ID": "e97c5e62-a6c4-4dc2-b80d-c307cbc5549f",
      "Request Type": "Refill",
      "Created At": "2025-05-17 13:59:52.848521202 UTC",
      "Updated At": "2025-05-17 13:59:52.848521890 UTC",
      "Active": false,
      "Allocation Amount": "1759218604441600B",
      "Signers": [
        {
          "Github Username": "spaceT9",
          "Signing Address": "f1id4vdnfmhic5lgf33jpwdugqphso7kmauc2w4va",
          "Created At": "2025-05-17 14:02:38.906000000 UTC",
          "Message CID": "bafy2bzacedxijzb5xvpv27ynsrfbttkb6d5fwdjm2lk2lntkuzvmmlne2pbuq"
        }
      ]
    },
    {
      "ID": "3d97de53-7150-42ff-a437-17e54ceb4f5b",
      "Request Type": "Refill",
      "Created At": "2025-07-16 13:55:55.101496040 UTC",
      "Updated At": "2025-07-16 13:55:55.101496688 UTC",
      "Active": false,
      "Allocation Amount": "2251799813685248B",
      "Signers": [
        {
          "Github Username": "spaceT9",
          "Signing Address": "f1id4vdnfmhic5lgf33jpwdugqphso7kmauc2w4va",
          "Created At": "2025-07-16 13:58:08.735000000 UTC",
          "Message CID": "bafy2bzaced6vedv5youaui7en756dtc6rqa7rkn4tc6w5ffhoelazslca62u6"
        }
      ]
    }
  ]
}